src/Enums/ОбработчикиДрайверовПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ОбработчикиДрайверовПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СДисплейПокупателя</Name>
					<Comment>ДисплейПокупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СРарусФискальныеРегистраторыМебиус</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СРарусФискальныеРегистраторыФеликс</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1ССканерыШтрихкода</Name>
					<Comment>СканерШтрихкода</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1ССканерыШтрихкодаNative</Name>
					<Comment>СканерШтрихкода</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1ССчитывателиМагнитныхКарт</Name>
					<Comment>СчитывательМагнитныхКарт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1ССчитывателиМагнитныхКартNative</Name>
					<Comment>СчитывательМагнитныхКарт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СФискальныйРегистраторЭмулятор</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СЭквайринговыеТерминалыСбербанк</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикARCUS2ЭквайринговыеТерминалыIngenico</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикARSККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикFITККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикIboxProПоддержкаMPosЭквайринга</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикIronLogicСчитывателиБесконтактныхКарт</Name>
					<Comment>СчитывательМагнитныхКарт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикMPos2canЭквайринг</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикMSTARККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикNEWTONККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикRightScanТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикSKAM1CЭквайринговыеСистемы</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикSKAMUNIPOSЭквайринговыеСистемы</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикSphinxReaderEH</Name>
					<Comment>СчитывательМагнитныхКарт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикTRPOS32ЭквайринговыеТерминалы</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикTRPOSЭквайринговыеТерминалы</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикUCSEFTPOSЭквайринговыеТерминалы</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикWNJIККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАртСофтФискальныйРегистратор</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолККТ54ФЗ10X</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАТОЛККТ54ФЗ10XФФД12</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолККТ54ФЗ9X</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолСканерыШтрихкода</Name>
					<Comment>СканерШтрихкода</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолСканерыШтрихкода8X</Name>
					<Comment>СканерШтрихкода</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолСчитывателиМагнитныхКарт</Name>
					<Comment>СчитывательМагнитныхКарт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолСчитывателиМагнитныхКарт8X</Name>
					<Comment>СчитывательМагнитныхКарт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолТерминалыСбораДанныхMobileLogistics</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолФискальныеРегистраторы</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолФискальныеРегистраторы8X</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолФискальныеРегистраторыУниверсальный</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикВедисофтПростыеЗвонки</Name>
					<Comment>IPТелефония</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикВерсияТK1Ф54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикВерсияТКасбиФР01К</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикВерсияТФискальныеРегистраторы</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикГАЗПРОМБАНКЭквайринговыеТерминалы</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикГексагонСканерыШтрихкода</Name>
					<Comment>СканерШтрихкода</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикГексагонТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикДримкасККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикДримкасККТVikiPrint</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикИнитпроККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикИнкотексККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикДримкасФискальныеРегистраторыVikiPrint</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикИНПАСЭквайринговыеТерминалыPulsar</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикИНПАСЭквайринговыеТерминалы</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикИскраККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикИскраФискальныеРегистраторыПрим</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикКАСТОМФ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикККСККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикККСККТ54ФЗ2Х</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикИНПАСЭквайринговыеТерминалыSmart</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикКлеверенсТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикИНПАСЭквайринговыеТерминалыUNIPOS</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикМЕБИУСККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикККСФискальныеРегистраторы</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикОРИОНФискальныеРегистраторы</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикРусГардСчитывательМагнитныхКарт</Name>
					<Comment>СчитывательМагнитныхКарт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикКристаллСервисФискальныеРегистраторыPirit</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканкодСканерыШтрихкода</Name>
					<Comment>СканерШтрихкода</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикМеркурийФискальныеРегистраторыКурск</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканкодТерминалыСбораДанныхCipherLab8G2</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканкодТерминалыСбораДанныхNative</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканситиТерминалСбораДанныхCitySoftBusiness</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканситиТерминалСбораДанныхCitySoftLite</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканситиТерминалСбораДанныхCitySoftStandart</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСБРФЭквайринговыеТерминалы</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканкодТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСканситиТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСчетмашККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикХеликсAtsAm</Name>
					<Comment>IPТелефония</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикХеликсBINOTEL</Name>
					<Comment>IPТелефония</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикХеликсCallTouch</Name>
					<Comment>IPТелефония</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикХеликсCoMagic</Name>
					<Comment>IPТелефония</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикХеликсITOOLABS</Name>
					<Comment>IPТелефония</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикХеликсMANGO</Name>
					<Comment>IPТелефония</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикХеликсOKTELL</Name>
					<Comment>IPТелефония</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикХеликсROSTELECOM</Name>
					<Comment>IPТелефония</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикХеликсПречековыйПринтерКассира</Name>
					<Comment>ПречековыйПринтер</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСофткейсЭквайринговыеТерминалы</Name>
					<Comment>ЭквайринговыйТерминал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикСтандартныеДрайвера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикХеликсСофтФон</Name>
					<Comment>IPТелефония</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМККТ54ФЗ415</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМККТ54ФЗ4ФФД12</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикХеликсЧековыйПринтерКассира</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМККТ54ФЗ</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикКассовогоСервера</Name>
					<Comment>ККТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМТерминалыСбораДанных</Name>
					<Comment>ТерминалСбораДанных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМФискальныеРегистраторы</Name>
					<Comment>ФискальныйРегистратор</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/МенеджерОборудованияКлиентПереопределяемый/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает текущую дату, приведенную к часовому поясу сеанса.
// Предназначена для использования вместо функции ТекущаяДата().
//
// Возвращаемое значение:
//  Дата - текущая дата.
//
Функция ДатаСеанса() Экспорт
	
	Возврат ТекущаяДата();
	
КонецФункции

// Функция возвращает объект обработчика драйвера по его наименованию.
//
// Параметры:
// ОбработчикДрайвера - ПеречислениеСсылка.ОбработчикиДрайверовПодключаемогоОборудования 
// - Ссылка на обработчик драйвера подключаемого оборудования.
// ЗагружаемыйДрайвер - Булево - Признак, что драйвер загружаемый.
// ТипОборудованияИмя - Строка - Представление типа оборудования.
//
// Возвращаемое значение:
//  ОбщийМодуль - Используемый модуль обработчика драйвера.
//
Функция ПолучитьОбработчикДрайвера(ОбработчикДрайвера, ЗагружаемыйДрайвер, ТипОборудованияИмя) Экспорт

	// Используем универсальный обработчик драйвера по стандарту "1С:Совместимо".
	#Если ВебКлиент Тогда
		Результат = ПодключаемоеОборудованиеУниверсальныйДрайверАсинхронноКлиент; 
	#Иначе
		Результат = ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
	#КонецЕсли
	
	// Обработчики драйверов не удовлетворяющие стандарту "1С:Совместимо".
	Если Не ЗагружаемыйДрайвер И ОбработчикДрайвера <> Неопределено Тогда
		
		// Сканеры штрихкода
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССканерыШтрихкода") Тогда
			Возврат ПодключаемоеОборудование1ССканерыШтрихкодаКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССканерыШтрихкодаNative") Тогда
			Возврат ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодСканерыШтрихкода") Тогда
			Возврат ПодключаемоеОборудованиеСканкодСканерыШтрихкодаКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолСканерыШтрихкода") Тогда
			Возврат ПодключаемоеОборудованиеАтолСканерыШтрихкодаКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикГексагонСканерыШтрихкода") Тогда
			Возврат ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
		КонецЕсли;
		// Конец Сканеры штрихкода
		
		// Считыватели магнитных карт
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССчитывателиМагнитныхКарт") Тогда
			Возврат ПодключаемоеОборудование1ССчитывателиМагнитныхКартКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолСчитывателиМагнитныхКарт") Тогда
			Возврат ПодключаемоеОборудованиеАтолСчитывателиМагнитныхКартКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикSphinxReaderEH") Тогда
			Возврат ПодключаемоеОборудованиеSphinxReaderEH;
		// ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикHelixReaderGantner") Тогда
		//	Возврат ПодключаемоеОборудованиеHelixReaderGantner;
		// ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикHelixGatWriter6000F") Тогда
		//	Возврат ПодключаемоеОборудованиеHelixGatWriter6000F;
		КонецЕсли;
		// Конец Считыватели магнитных карт

		// Фискальные регистраторы
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СФискальныйРегистраторЭмулятор") Тогда
			Возврат ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеАтолФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолФискальныеРегистраторыУниверсальный") Тогда
			Возврат ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолФискальныеРегистраторы8X") Тогда
			Возврат ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВерсияТФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеВерсияТФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикККСФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеККСФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеШтрихМФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикОРИОНФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеОРИОНФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СРарусФискальныеРегистраторыФеликс") Тогда
			Возврат ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикМеркурийФискальныеРегистраторыКурск") Тогда
			Возврат ПодключаемоеОборудованиеМеркурийФискальныеРегистраторыКурск;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсЧековыйПринтерКассира") Тогда
			Возврат ПодключаемоеОборудованиеХеликсЧековыйПринтерКассира;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАртСофтФискальныйРегистратор") Тогда		
			Возврат ПодключаемоеОборудованиеАртСофтФискальныйРегистратор;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикКристаллСервисФискальныеРегистраторыPirit") Тогда
			Возврат  ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикКристаллСервисФискальныеРегистраторыPirit") Тогда
			Возврат  ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
		КонецЕсли;
		// Конец Фискальные регистраторы
		
		// Кассовые сервера		
		 Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикКассовогоСервера") Тогда
			Возврат ПодключаемоеОборудованиеКассовыйСервер;
		 КонецЕсли;  
		// Конец кассовые сервера	
		
		// Терминалы сбора данных
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолТерминалыСбораДанных") Тогда
			Возврат ПодключаемоеОборудованиеАтолТерминалыСбораДанныхКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМТерминалыСбораДанных") Тогда
			Возврат ПодключаемоеОборудованиеШтрихМТерминалыСбораДанныхКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодТерминалыСбораДанных") Тогда
			Возврат ПодключаемоеОборудованиеСканкодТерминалыСбораДанныхКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканситиТерминалыСбораДанных") Тогда
			Возврат ПодключаемоеОборудованиеСканситиТерминалыСбораДанныхКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикКлеверенсТерминалыСбораДанных") Тогда
			Возврат ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикГексагонТерминалыСбораДанных") Тогда
			Возврат ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолТерминалыСбораДанныхMobileLogistics") Тогда
			Возврат ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
		КонецЕсли;
		// Конец Терминалы сбора данных
		
		// Эквайринговые терминалы
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСБРФЭквайринговыеТерминалы") Тогда
			Возврат ПодключаемоеОборудованиеСБРФЭквайринговыеТерминалыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикИНПАСЭквайринговыеТерминалыPulsar") Тогда
			Возврат ПодключаемоеОборудованиеИНПАСЭквайринговыеТерминалыPulsarКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикИНПАСЭквайринговыеТерминалыSmart") Тогда
			Возврат ПодключаемоеОборудованиеИНПАСЭквайринговыеТерминалыSmartКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСофткейсЭквайринговыеТерминалы") Тогда
			Возврат ПодключаемоеОборудованиеСофтКейсЭквайринговыеТерминалыКлиент;
		КонецЕсли;
		// Конец Эквайринговые терминалы   					
		  				
		// Прочее
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсOKTELL") 
			ИЛИ ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсMANGO")
			// ИЛИ ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсINFINITY")
			ИЛИ ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсITOOLABS")
			ИЛИ ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсROSTELECOM")
			// ИЛИ ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсAtsAm")
			ИЛИ ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсBINOTEL")
			ИЛИ ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсCallTouch")
			// ИЛИ ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикSphinxReaderEH") 
			ИЛИ ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсПречековыйПринтерКассира") 
			// ИЛИ ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсПречековыйПринтерКухни") 
			// ИЛИ ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсПлатежныеТерминалы")
			Тогда
			Возврат Истина; 
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВедисофтПростыеЗвонки") Тогда
			Возврат IPТелефонияКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсCoMagic") Тогда
			Возврат Истина;
		КонецЕсли; 		
		  				
		// ККТ
		// Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикLifePayККТ54ФЗ") Тогда
		//	Возврат ПодключаемоеОборудованиеLifePayККТ54ФЗКлиент;
		// ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикCloudKassirККТ54ФЗ") Тогда
		//	Возврат ПодключаемоеОборудованиеCloudKassirККТ54ФЗКлиент;
		// ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикЭвоторККТ54ФЗ") Тогда
		//	Возврат ПодключаемоеОборудованиеЭвоторККТ54ФЗКлиент;
		// КонецЕсли;	
		
	КонецЕсли;
			
	Возврат Результат;
		
КонецФункции

// Процедура отправляет электронное сообщение на электронную почта и абонентский номер.  
//
// Параметры:
// ПараметрыЧека - Структура - Параметры чека ККТ
//  *ПозицииЧека - Массив из См. МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека - .
// ТекстСообщения - Строка - Текст сообщения покупателю.
// ПокупательEmail - Строка - Электронную почта покупателя.
// ПокупательНомер - Строка - Абонентский номер покупателя.
//
Процедура НачатьОтправкуЭлектронногоЧека(ПараметрыЧека, ТекстСообщения, ПокупательEmail, ПокупательНомер) Экспорт
	
	РассылкаЭлектронныхЧековКлиент.НачатьОтправкуЭлектронногоЧека(ПараметрыЧека, ТекстСообщения, ПокупательEmail, ПокупательНомер);
	
КонецПроцедуры

// Начинает рассылку или ставит задачу на рассылку нефискальных документов.
// Которые заданы в шаблоне чека.
//
// Параметры:
// Параметры - Массив из См. МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека - .
// *ПозицииЧека - Массив из Структура - где: 
//
Процедура НачатьРассылкуНефискальныхДокументов(Параметры) Экспорт
	
КонецПроцедуры

#Область ОборудованиеККТ

// Переопределяет доступное ККТ для фискализации чека
// Параметры:
//  РеквизитыЧека - Структура - реквизиты фискального чека
//  СписокУстройств - Массив - список доступных ККТ для фискализации
//  ИдентификаторУстройстваККТ - СправочникСсылка.ПодключаемоеОборудование - выбранное ККТ для фискализации
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ДоступноеККТДляФискализации(РеквизитыЧека, СписокУстройств, ИдентификаторУстройстваККТ, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Событие при открытии смены на ККТ 
// Параметры:
//  ИдентификаторУстройстваККТ - СправочникСсылка.ПодключаемоеОборудование - выбранное ККТ
//  ПараметрыРегистрации - Структура - Параметры регистрации ФН
//
Процедура ПриОткрытииСменыНаККТ(ИдентификаторУстройстваККТ, ПараметрыРегистрации) Экспорт

КонецПроцедуры

#КонецОбласти

#Область РаботаСФормойЭкземпляраОборудования

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриОткрытии".
//
// Параметры:
// Объект - СправочникОбъект.ПодключаемоеОборудование - объект подключаемого оборудования.
// ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
// Отказ - Булево - признак отказа.
//
Процедура ЭкземплярОборудованияПриОткрытии(Объект, ЭтаФорма, Отказ) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗакрытием".
//
//
// Параметры:
// Объект - СправочникОбъект.ПодключаемоеОборудование - объект подключаемого оборудования.
// ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
// Отказ - Булево - признак отказа.
// СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ЭкземплярОборудованияПередЗакрытием(Объект, ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗаписью".
//
// Параметры:
// Объект - СправочникОбъект.ПодключаемоеОборудование - объект подключаемого оборудования.
// ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
// Отказ - Булево - признак отказа.
// ПараметрыЗаписи - Структура - параметры записи оборудования.
//
Процедура ЭкземплярОборудованияПередЗаписью(Объект, ЭтаФорма, Отказ, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПослеЗаписи".
//
// Параметры:
// Объект - СправочникОбъект.ПодключаемоеОборудование - объект подключаемого оборудования.
// ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
// ПараметрыЗаписи - Структура - параметры записи оборудования.
//
Процедура ЭкземплярОборудованияПослеЗаписи(Объект, ЭтаФорма, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ОбработкаНавигационнойСсылки".
//
// Параметры:
// Объект - СправочникОбъект.ПодключаемоеОборудование - объект подключаемого оборудования.
// ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
// НавигационнаяСсылкаФорматированнойСтроки - Строка - навигационная ссылка.
// СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ЭкземплярОборудованияОбработкаНавигационнойСсылки(Объект, ЭтаФорма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ТипОборудованияОбработкаВыбора".
//
// Параметры:
// Объект - СправочникОбъект.ПодключаемоеОборудование - объект подключаемого оборудования.
// ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
// ЭтотОбъект - СправочникОбъект.ПодключаемоеОборудование - текущий объект подключаемого оборудования.
// Элемент - ПолеФормы - изменяемый элемент.
// ВыбранноеЗначение - ПеречислениеСсылка.ТипыПодключаемогоОборудования - выбранное значение.
//
Процедура ЭкземплярОборудованияТипОборудованияВыбор(Объект, ЭтаФорма, ЭтотОбъект, Элемент, ВыбранноеЗначение) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область РаспределеннаяФискализации

// Переопределяемые действия после открытия чека в очереди чеков.
//
Процедура ФискализацияЧековВОчередиПослеОткрытияЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

// Переопределяемые действия после ошибки печати чека в очереди чеков.
//
Процедура ФискализацияЧековВОчередиПослеОшибкиПечатиЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

#КонецОбласти


#Область РаботаСФормойЭкземпляраФискальныеОперации

// Дополнительные переопределяемые действия с управляемой формой в Фискальные операции
// при событии "ОбработкаНавигационнойСсылки".
//
Процедура ФормаЗаписиФискальныеОперацииОбработкаНавигационнойСсылки(Запись, ЭтаФорма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

Процедура ОбработатьСобытие() Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Стоматология      

// Осуществляет печать фискального чека
//
Функция ПечатьЧека(ОбщийМодульОборудования, ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры, ВывестиСообщениеПользователю = Ложь) Экспорт
	
	ТаблицаНоменклатуры = ВходныеПараметры[0];
	ТаблицаОплат        = ВходныеПараметры[1];
	ОбщиеПараметры      = ВходныеПараметры[2];
		                 
	Результат  = Истина;
	// Открываем чек
	Результат = ОбщийМодульОборудования.ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения,
	                       ОбщиеПараметры[0] = 1, ОбщиеПараметры[1], ВыходныеПараметры);

	// Печатаем строки чека   
	Если Результат Тогда
		ОшибкаПриПечатиСтроки = Ложь;
		// Печатаем строки чека
		Для ИндексМассива = 0 По ТаблицаНоменклатуры.Количество() - 1 Цикл
			Наименование  = ТаблицаНоменклатуры[ИндексМассива][0].Значение;
			Количество    = ТаблицаНоменклатуры[ИндексМассива][5].Значение;
			Цена          = ТаблицаНоменклатуры[ИндексМассива][4].Значение;
			ПроцентСкидки = ТаблицаНоменклатуры[ИндексМассива][8].Значение;
			Сумма         = ТаблицаНоменклатуры[ИндексМассива][9].Значение;
			НомерСекции   = ТаблицаНоменклатуры[ИндексМассива][3].Значение;
			СтавкаНДС     = ТаблицаНоменклатуры[ИндексМассива][12].Значение;

			// Если НЕ ОбщийМодульОборудования.НапечататьФискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения,
			//								   Наименование, Количество, Цена, ПроцентСкидки, Сумма,
			//								   НомерСекции, СтавкаНДС, ВыходныеПараметры) Тогда
			//	ОшибкаПриПечатиСтроки = Истина;   
			//	Прервать;
			// КонецЕсли;
			
			Если НЕ ОбщийМодульОборудования.НапечататьФискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения,
											   Наименование, Количество, Цена, Сумма,
											   НомерСекции, СтавкаНДС, ВыходныеПараметры) Тогда
				ОшибкаПриПечатиСтроки = Истина;   
				Прервать;
			КонецЕсли;

			
		КонецЦикла;

		Если НЕ ОшибкаПриПечатиСтроки Тогда
		  	// Закрываем чек
			Результат = ОбщийМодульОборудования.ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплат, ВыходныеПараметры);	
		Иначе
			Результат = Ложь;
		КонецЕсли;
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
